=begin
==============================================================================
地图图块合成器 v1.2  By 叶子
==============================================================================
脚本使用：      来源：
鼠标            geocities.jp
BMP文件导出     MOMOMO
完美输入法修正  灼眼的夏娜
DEBUG用脚本     灼眼的夏娜
==============================================================================
9-22-2006 v0.9
基本功能完成，撤消恢复功能未开放
10-15-2006 v1.0
撤消与恢复功能开放
10-16-2006 v1.1
增加输出时图块不透明化功能，防止因为阴影的限制，导致丢失颜色
3-29-2007 v1.2
增加重命名文件功能
修正一个恢复的BUG
增加恢复未导出图块功能
增强对大图块的处理能力
==============================================================================
功能：
可以将两个以上的图块切割合并为一个新图块，同时会保留源图块的通行、优先级等信息
==============================================================================
使用说明：
·先设置目标工程的完整路径（留空也可），然后运行工程就可以开始编辑图块。
·完成之后点击“导出..”，选择导出图块ID，就可以将数据保存到目标工程的数据库中。
·图块的图片文件则会导出到图块合成器的Tilesets文件夹下，请先在媒体库中手动导入
到目标工程，然后重启工程，否则图块设置可能不会被保存。导入时注意设置透明色和半
透明色。
·如果未导出就关闭窗口，下次运行合成器时会提示是否恢复未导出图块。恢复的信息保
存在Recover.rxdata中。
==============================================================================
=end

# 各种设置

# 目标工程完整路径，例如 PATH = "D:/RMXP/Project1"，注意斜线的方向
# 留空则默认为合成器文件夹下的数据，图块设置会导出到合成器的数据库
PATH = ""

# 输出时图块不透明化，设为false的话，输出时可以节约一点时间，但可能会丢失阴影
OUTPUT_ALPHA_255 = true

# 输出图块底色，如果图块不透明化设置为false，只能是白色，否则会丢失阴影
# 但设置为白色的话，会对“雪原”等图块有严重影响
OUTPUT_BACK_COLOR = Color.new(255, 0, 255)

# 浏览窗口图块底色（无太大影响，认为美观即可）
VIEW_BACK_COLOR = Color.new(239, 243, 255)

# 撤消最大次数，必须为1以上，越大占用内存越多
MAX_STEP = 5
