#==============================================================================
# ■ Window_Recover
#------------------------------------------------------------------------------
# 　地图图块合成器的数据恢复选择窗口。
#==============================================================================

class Window_Recover < Window_Base
  #--------------------------------------------------------------------------
  # ● 初始化对像
  #     width    : 窗口的宽
  #     commands : 命令字符串序列
  #--------------------------------------------------------------------------
  def initialize
    super(140, (480 - 96) / 2, 360, 96)
    self.z = 200
    self.opacity = 160
    self.contents = Bitmap.new(width - 32, height - 32)
    self.contents.draw_text(0, 0, 328, 32, '是否恢复上次未导出的数据？')
    self.contents.draw_text(66, 32, 32, 32, '是', 1)
    self.contents.draw_text(230, 32, 32, 32, '否', 1)
  end
  #--------------------------------------------------------------------------
  # ● 返回选中命令
  #--------------------------------------------------------------------------
  def command(mouse_x, mouse_y)
    if mouse_y > 32 and mouse_y < 64
      if mouse_x > 66 and mouse_x < 98
        return '是'
      elsif mouse_x > 230 and mouse_x < 262
        return '否'
      end
    end
  end
end
